hso-esk/emb6/target/mcu/efm32lg840f128/efm32lg840.c
/*
 * emb6 is licensed under the 3-clause BSD license. This license gives everyone
 * the right to use and distribute the code, either in binary or source code
 * format, as long as the copyright license is retained in the source code.
 *
 * The emb6 is derived from the Contiki OS platform with the explicit approval
 * from Adam Dunkels. However, emb6 is made independent from the OS through the
 * removal of protothreads. In addition, APIs are made more flexible to gain
 * more adaptivity during run-time.
 *
 * The license text is:
 *
 * Copyright (c) 2015,
 * Hochschule Offenburg, University of Applied Sciences
 * Laboratory Embedded Systems and Communications Electronics.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO
 * EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/*============================================================================*/
/**
 * \addtogroup bsp
 * @{
 * \addtogroup mcu MCU HAL library
 * @{
 * \addtogroup efm32
 * @{
 */
/*! \file   efm32lg840f128/efm32lg840.c

    \author Manuel Schappacher manuel.schappacher@hs-offenburg.de

    \brief  Hardware dependent initialization for EFM32LG990F256.

   \version 0.0.1
*/
/*============================================================================*/

/*==============================================================================
                                 INCLUDE FILES
==============================================================================*/

#include "emb6.h"

#include "target.h"
#include "hwinit.h"
#include "bsp.h"
#include "board_conf.h"

#include "em_device.h"
#include "em_chip.h"
#include "em_cmu.h"
#include "em_wdog.h"
#include "em_int.h"
#include "em_gpio.h"
#include "spidrv.h"
#include "em_usart.h"
#include "em_timer.h"
#include "gpiointerrupt.h"

#include "lib_tmr.h"

/*==============================================================================
                                     MACROS
==============================================================================*/
#define     LOGGER_ENABLE           LOGGER_HAL
#include    "logger.h"

#ifndef EFM32_LED_ACTIVE_HIGH
#define EFM32_LED_ACTIVE_HIGH       TRUE
#endif /* #ifndef EFM32_LED_ACTIVE_HIGH */

#if EFM32_LED_ACTIVE_HIGH
#define EFM32_LED_OUT_VAL           0
#else /* #ifndef EFM32_LED_ACTIVE_HIGH */
#define EFM32_LED_OUT_VAL           1
#endif /* #ifndef EFM32_LED_ACTIVE_HIGH */


/*==============================================================================
                                     ENUMS
==============================================================================*/

/*==============================================================================
                         STRUCTURES AND OTHER TYPEDEFS
==============================================================================*/


/**
 * \brief    Description of a single Pin.
 */
typedef struct
{
    /** Port */
    GPIO_Port_TypeDef port;
    /** pin */
    uint8_t pin;
    /** mode */
    GPIO_Mode_TypeDef mode;
    /** direction */
    uint8_t val;

} s_hal_gpio_pin_t;


/**
 * \brief    Decription of an SPI interface.
 */
typedef struct
{
    /** handle to the SPI driver */
    SPIDRV_HandleData_t hndl;
    /** handle pointer to the SPI driver */
    SPIDRV_Handle_t pHndl;
    /** clk select pin */
    s_hal_gpio_pin_t clkPin;
    /** tx  pin */
    s_hal_gpio_pin_t txPin;
    /** rx pin */
    s_hal_gpio_pin_t rxPin;
    /** chip select pin */
    s_hal_gpio_pin_t csPin;

} s_hal_spiDrv;


/**
 * \brief    All available GPIOs.
 */
typedef enum
{
    /** RF reset pin */
    e_hal_gpios_rf_rst,
    /** RF IRQ pin */
    e_hal_gpios_rf_irq,
    /** RF slp pin */
    e_hal_gpios_rf_slp,

    /** RF CC112x/CC120x GPIO0 pin */
    e_hal_gpios_rf_isq_0,
    /** RF CC112x/CC120x GPIO2 pin */
    e_hal_gpios_rf_isq_1,
    /** RF CC112x/CC120x GPIO3 pin */
    e_hal_gpios_rf_isq_2,

    e_hal_gpios_max

}e_hal_gpios_t;

/*==============================================================================
                           LOCAL FUNCTION PROTOTYPES
==============================================================================*/

/* initialization of the watchdog */
static void _hal_wdcInit( void );

/* initialization of the tick counter */
static void _hal_tcInit( void );

/* initialization of clocks */
static void _hal_clksInit( void );

/* initialization of uart */
static void _hal_uartInit( void );

/* callback for the Tick Counter */
static void _hal_tcCb( void );


/*==============================================================================
                          VARIABLE DECLARATIONS
==============================================================================*/

/** Ticks since startup */
static clock_time_t volatile l_hal_tick;
/** Seconds since startup */
static clock_time_t volatile l_hal_sec;

