hso-esk/emb6/target/mcu/efm32lg840f128/efm32lg840.c
/** UART instance */
static USART_TypeDef *uart = USART0;
USART_TypeDef *uartStdio = NULL;
static USART_InitAsync_TypeDef uartInit = USART_INITASYNC_DEFAULT;

/** Definition of the SPI interface */
static s_hal_spiDrv s_hal_spi = {
        .pHndl = NULL,
        .clkPin = {EFM32_IO_PORT_USART_CLK, EFM32_IO_PIN_USART_CLK, gpioModePushPull, 0},
        .txPin = {EFM32_IO_PORT_USART_TX, EFM32_IO_PIN_USART_TX, gpioModePushPull, 0},
        .rxPin = {EFM32_IO_PORT_USART_RX, EFM32_IO_PIN_USART_RX, gpioModeInputPull, 0},
        .csPin = {EFM32_IO_PORT_USART_CS, EFM32_IO_PIN_USART_CS, gpioModePushPull, 0}
};

s_hal_gpio_pin_t s_hal_gpio[e_hal_gpios_max] =
{
    {EFM32_IO_PORT_RF_RST, EFM32_IO_PIN_RF_RST, gpioModePushPull,  0},  /* e_hal_gpios_rf_rst */
    {EFM32_IO_PORT_RF_IRQ, EFM32_IO_PIN_RF_IRQ, gpioModeInputPull, 0},  /* e_hal_gpios_rf_irq */
    {EFM32_IO_PORT_RF_SLP, EFM32_IO_PIN_RF_SLP, gpioModePushPull,  0},  /* e_hal_gpios_rf_slp */
};

/** External interrupt GPIOs table */
s_hal_gpio_pin_t s_hal_exti_gpio[E_TARGET_EXT_INT_MAX] =
{
    {EFM32_IO_PORT_RF_IRQ_0, EFM32_IO_PIN_RF_IRQ_0, gpioModeInputPull, 0},  /* E_TARGET_EXT_INT_0 */
    {EFM32_IO_PORT_RF_IRQ_2, EFM32_IO_PIN_RF_IRQ_2, gpioModeInputPull, 0},  /* E_TARGET_EXT_INT_1 */
    {EFM32_IO_PORT_RF_IRQ_3, EFM32_IO_PIN_RF_IRQ_3, gpioModeInputPull, 0},  /* E_TARGET_EXT_INT_2 */
    {0, 0, 0, 0},  /* E_TARGET_EXT_INT_3 is not supported */

    {EFM32_IO_PORT_RF_IRQ,   EFM32_IO_PIN_RF_IRQ,   gpioModeInputPull, 0},  /* INT for Atmel RF */
    {0, 0, 0, 0},  /* E_TARGET_USART_INT is not supported */
};

/** User IOs */
s_hal_gpio_pin_t s_hal_userio[] =
{
    {EFM32_IO_PORT_LED0, EFM32_IO_PIN_LED0, gpioModePushPull,  EFM32_LED_OUT_VAL},  /* LED0 */
    {EFM32_IO_PORT_LED1, EFM32_IO_PIN_LED1, gpioModePushPull, EFM32_LED_OUT_VAL},   /* LED1 */
};

/** External interrupt handler table */
pfn_intCallb_t pf_hal_exti[E_TARGET_EXT_INT_MAX] = {0};

void* p_spiMisoPin = &s_hal_spi.rxPin;

/** registered callback function for the uart interrupt */
pfn_intCallb_t pf_hal_rxCallb = NULL;


/*==============================================================================
                                LOCAL CONSTANTS
==============================================================================*/

/** mac address */
//const uint8_t mac_address[8] = {RADIO_MAC_ADDR};

/*==============================================================================
                                LOCAL FUNCTIONS
==============================================================================*/

/**
 *    \brief    Initializes Watchdog.
 */
static void _hal_wdcInit(void)
{
    WDOG_Init_TypeDef wd = {
            FALSE, FALSE, FALSE, FALSE, FALSE,
            FALSE, wdogClkSelLFRCO, wdogPeriod_256k
    };

    /* disable watchdog at initialization*/
    wd.enable = 0;
    WDOG_Init( &wd );

} /* _hal_tcInit() */


/**
 *    \brief    Initializes SysTick.
 */
static void _hal_tcInit(void)
{
    uint32_t l_ticks;
    TIMER_TypeDef* ps_timer = TIMER1;
    TIMER_Init_TypeDef s_timerInit = TIMER_INIT_DEFAULT;

    s_timerInit.enable = true;
    s_timerInit.prescale = timerPrescale2;
    s_timerInit.riseAction = timerInputActionReloadStart;

    /* Calculate ticks */
    l_ticks = SystemHFClockGet() / 2 / 1000;

    /* configure timer for 1ms */
    TIMER_TopSet( ps_timer, l_ticks );
    /* enable timer interrupts */
    NVIC_DisableIRQ( TIMER1_IRQn );
    NVIC_ClearPendingIRQ( TIMER1_IRQn );
    NVIC_EnableIRQ( TIMER1_IRQn );
    TIMER_IntEnable( ps_timer, TIMER_IEN_OF );

    /* initialize and start timer */
    TIMER_Init( ps_timer, &s_timerInit );

} /* _hal_tcInit() */


/**
 *    \brief    Initializes IOs.
 */
static void _hal_clksInit( void )
{
    /* enable required clocks */
    CMU_ClockEnable(cmuClock_HFPER, true);
    CMU_ClockEnable(cmuClock_GPIO, true);
    CMU_ClockEnable(cmuClock_TIMER1, true);
    CMU_ClockEnable(cmuClock_USART0, true);
    CMU_HFRCOBandSet(cmuHFRCOBand_28MHz);
}

/**
 *    \brief    Initialize UART.
 */
static void _hal_uartInit( void )
{
    /* Prepare struct for initializing UART in asynchronous mode*/
    uartInit.enable       = usartDisable;   /* Don't enable UART upon intialization */
    uartInit.refFreq      = 0;              /* Provide information on reference frequency. When set to 0, the reference frequency is */
    uartInit.baudrate     = 115200;         /* Baud rate */
    uartInit.oversampling = usartOVS16;     /* Oversampling. Range is 4x, 6x, 8x or 16x */
    uartInit.databits     = usartDatabits8; /* Number of data bits. Range is 4 to 10 */
    uartInit.parity       = usartNoParity;  /* Parity mode */
    uartInit.stopbits     = usartStopbits1; /* Number of stop bits. Range is 0 to 2 */
    uartInit.mvdis        = false;          /* Disable majority voting */
    uartInit.prsRxEnable  = false;          /* Enable USART Rx via Peripheral Reflex System */
    uartInit.prsRxCh      = usartPrsRxCh0;  /* Select PRS channel if enabled */

    /* Initialize USART with uartInit struct */
    USART_InitAsync(uart, &uartInit);

    /* Configure GPIO pins */
    GPIO_PinModeSet(gpioPortE, 13, gpioModePushPull, 1);
    GPIO_PinModeSet(gpioPortE, 12, gpioModeInput, 0);

    /* Prepare UART Rx and Tx interrupts */
    USART_IntClear(uart, _USART_IFC_MASK);
    USART_IntEnable(uart, USART_IEN_RXDATAV);
    NVIC_ClearPendingIRQ(USART0_RX_IRQn);
    NVIC_ClearPendingIRQ(USART0_TX_IRQn);
    NVIC_EnableIRQ(USART0_RX_IRQn);
    NVIC_EnableIRQ(USART0_TX_IRQn);

    /* Enable I/O pins at UART1 location #3 */
    uart->ROUTE = USART_ROUTE_RXPEN | USART_ROUTE_TXPEN | USART_ROUTE_LOCATION_LOC3;

    /* Enable UART */
    USART_Enable(uart, usartEnable);

    /* set external UART instance */
    uartStdio = uart;

    /* disable STDIO buffer */
    setvbuf( stdout , NULL , _IONBF , 0 );
}


/**
 * \brief    SysTick handler to increase internal ticks.
 */
static void _hal_tcCb( void )
{
    /* Indicate timer update to the emb6 timer */
    if( l_hal_tick % CONF_TICK_SEC == 0 )
        l_hal_sec++;
    l_hal_tick++;

    Tmr_Update();
} /* _isr_tc_interrupt() */


/**
 * \brief   External interrupt handler
 */
static void _hal_extiCb(uint8_t pin)
{
    uint8_t ix;

    for (ix = 0; ix < E_TARGET_EXT_INT_MAX; ix++) {
        if (s_hal_exti_gpio[ix].pin == pin) {
            /*
             * TI and Atmel transceivers use same pin number for one interrupt
             * (EFM32_IO_PORT_RF_IRQ_3 and EFM32_IO_PORT_RF_IRQ). Therefore
             * if an interrupt handling function found with pin number of
             * interest is 0, let MCU iterate interrupt table to find the
             * correct interrupt occurred
             */
            if (pf_hal_exti[ix]) {
                pf_hal_exti[ix](NULL);
            }
        }
    }
}


/**
 *    \brief    Timer1 interrupt handler.
 */
void TIMER1_IRQHandler()
{
    uint32_t flags;
    INT_Disable();

    flags = TIMER_IntGet( TIMER1 );
    _hal_tcCb();
    TIMER_IntClear( TIMER1, flags );

    INT_Enable();
}

void USART0_RX_IRQHandler(void)
{
    /* Check for RX data valid interrupt */
    if (uart->IF & USART_IF_RXDATAV) {

        /* Copy data into RX Buffer */
        uint8_t rxData = USART_Rx(uart);
        if (pf_hal_rxCallb != NULL)
            pf_hal_rxCallb(&rxData);
    }
}


/*==============================================================================
                                 API FUNCTIONS
==============================================================================*/

/*==============================================================================
  hal_enterCritical()
==============================================================================*/
void hal_enterCritical( void )
{
    /* enter critical section */
    INT_Disable();

