hso-esk/emb6/target/mcu/efm32lg840f128/efm32lg840.c
} /* hal_enterCritical() */

/*==============================================================================
  hal_exitCritical()
==============================================================================*/
void hal_exitCritical( void )
{
    /* exit critical section */
    INT_Enable();

}/* hal_exitCritical() */

/*==============================================================================
  hwinit_init()
==============================================================================*/
int8_t hal_init (void)
{
    uint8_t ix;
    uint8_t led_num;
    s_hal_gpio_pin_t *p_gpioPin;

    /* reset callback */
    for (ix = 0; ix < E_TARGET_EXT_INT_MAX; ix++) {
        pf_hal_exti[ix] = 0;
    }

    /* initialize Chip */
    CHIP_Init();

    /* initialize clocks */
    _hal_clksInit();

    /* initialize UART */
    _hal_uartInit();

    /* initialize watchdog */
    _hal_wdcInit();

    /* initialize SysTicks */
    _hal_tcInit();

    /* initialize user IOs */
    led_num = sizeof(s_hal_userio) / sizeof(s_hal_gpio_pin_t);
    for (ix = 0; ix < led_num; ix++) {
        p_gpioPin = &s_hal_userio[ix];
        GPIO_PinModeSet(p_gpioPin->port, p_gpioPin->pin, p_gpioPin->mode,
                p_gpioPin->val);
    }

    return 1;
}/* hal_init() */


/*==============================================================================
  hal_getrand()
==============================================================================*/
uint8_t hal_getrand(void)
{
    // TODO implement this function
    return 0;
}/* hal_getrand() */


/*==============================================================================
  hal_ledOff()
==============================================================================*/
void hal_ledOff(uint16_t ui_led)
{
    s_hal_gpio_pin_t* p_gpioPin = NULL;

    switch( ui_led )
    {
        case 0:
            p_gpioPin = &s_hal_userio[0];
            break;
        case 1:
            p_gpioPin = &s_hal_userio[1];
            break;
        default:
            break;
    }

    if( p_gpioPin != NULL )
#if EFM32_LED_ACTIVE_HIGH
        GPIO_PinOutClear( p_gpioPin->port, p_gpioPin->pin );
#else
        GPIO_PinOutSet( p_gpioPin->port, p_gpioPin->pin );
#endif /* EFM32_LED_ACTIVE_HIGH */
} /* hal_ledOff() */


/*==============================================================================
  hal_ledOn()
==============================================================================*/
void hal_ledOn(uint16_t ui_led)
{
    s_hal_gpio_pin_t* p_gpioPin = NULL;

    switch( ui_led )
    {
        case 0:
            p_gpioPin = &s_hal_userio[0];
            break;
        case 1:
            p_gpioPin = &s_hal_userio[1];
            break;
        default:
            break;
    }

    if( p_gpioPin != NULL )
#if EFM32_LED_ACTIVE_HIGH
        GPIO_PinOutSet( p_gpioPin->port, p_gpioPin->pin );
#else
    GPIO_PinOutClear( p_gpioPin->port, p_gpioPin->pin );
#endif /* EFM32_LED_ACTIVE_HIGH */
} /* hal_ledOn() */


/*==============================================================================
  hal_extiClear()
 =============================================================================*/
void hal_extiRegister(en_targetExtInt_t     e_extInt,
                      en_targetIntEdge_t    e_edge,
                      pfn_intCallb_t        pfn_intCallback)
{
#if NETSTK_CFG_ARG_CHK_EN
    if (pfn_intCallback == NULL) {
        return;
    }
#endif


    s_hal_gpio_pin_t *p_gpioPin;
    uint8_t is_falling_edge;
    uint8_t is_rising_edge;

    /*
     * This functions initializes the dispatcher register. Typically
     * GPIOINT_Init() is called once in your startup code.
     */
    GPIOINT_Init();


    switch (e_extInt) {
        case E_TARGET_USART_INT:
            pf_hal_rxCallb = pfn_intCallback;
            break;

        case E_TARGET_RADIO_INT:
        case E_TARGET_EXT_INT_0:
        case E_TARGET_EXT_INT_1:
        case E_TARGET_EXT_INT_2:
            /*
             * Treat external interrupt configurations in same manner
             */
            p_gpioPin = &s_hal_exti_gpio[e_extInt];

            /* store interrupt callback */
            pf_hal_exti[e_extInt] = pfn_intCallback;

            /* register callback function */
            GPIOINT_CallbackRegister(p_gpioPin->pin, _hal_extiCb);

            /* configure external interrupt GPIOs */
            GPIO_PinModeSet(p_gpioPin->port,
                            p_gpioPin->pin,
                            p_gpioPin->mode,
                            p_gpioPin->val);

            /* configure edge detection and disable interrupt by default */
            is_rising_edge = (e_edge == E_TARGET_INT_EDGE_RISING);
            is_falling_edge = (e_edge == E_TARGET_INT_EDGE_FALLING);
            GPIO_IntConfig(p_gpioPin->port,
                           p_gpioPin->pin,
                           is_rising_edge,
                           is_falling_edge,
                           FALSE);  /* enable */
            break;

        default:
            break;
    }
} /* hal_extiRegister() */


/*==============================================================================
  hal_extiClear()
 =============================================================================*/
void hal_extiClear(en_targetExtInt_t e_extInt)
{
    uint32_t pin_msk;

    pin_msk = 1 << (s_hal_exti_gpio[e_extInt].pin);
    GPIO_IntClear(pin_msk);
} /* hal_extiClear() */


/*==============================================================================
  hal_extiEnable()
 =============================================================================*/
void hal_extiEnable(en_targetExtInt_t e_extInt)
{
    uint32_t pin_msk;

#if 1
    if (e_extInt != E_TARGET_USART_INT) {
        pin_msk = 1 << (s_hal_exti_gpio[e_extInt].pin);
        GPIO_IntEnable(pin_msk);
    }
#else
    pin_msk = 1 << (s_hal_exti_gpio[e_extInt].pin);
    GPIO_IntEnable(pin_msk);
#endif
} /* hal_extiEnable() */

/*==============================================================================
  hal_extiDisable()
 =============================================================================*/
void hal_extiDisable(en_targetExtInt_t e_extInt)
{
    uint32_t pin_msk;

    pin_msk = 1 << (s_hal_exti_gpio[e_extInt].pin);
    GPIO_IntDisable(pin_msk);
} /* hal_extiDisable() */


/*==============================================================================
  hal_delay_us()
 =============================================================================*/
void hal_delay_us( uint32_t i_delay )
{
    volatile int i = 0;
    uint32_t l_ticks = ((SystemCoreClockGet() / 1000000) * i_delay) / 10;
    for( i = 0; i < l_ticks; i++ );

} /* hal_delay_us() */

/*==============================================================================
  hal_pinInit()
 =============================================================================*/
void* hal_ctrlPinInit(en_targetExtPin_t e_pinType)
{
    s_hal_gpio_pin_t* p_gpioPin = NULL;

    switch (e_pinType){
        case E_TARGET_RADIO_RST:

            p_gpioPin = &s_hal_gpio[e_hal_gpios_rf_rst];
            /* configure pin */
            GPIO_PinModeSet( p_gpioPin->port, p_gpioPin->pin, p_gpioPin->mode, p_gpioPin->val );
            /* set pin */
            GPIO_PinOutSet( p_gpioPin->port, p_gpioPin->pin );
            break;

        case E_TARGET_RADIO_SLPTR:

            p_gpioPin = &s_hal_gpio[e_hal_gpios_rf_slp];
            /* configure pin */
            GPIO_PinModeSet( p_gpioPin->port, p_gpioPin->pin, p_gpioPin->mode, p_gpioPin->val );
            /* set pin */
            GPIO_PinOutSet( p_gpioPin->port, p_gpioPin->pin );
            break;

        default:

