hso-esk/emb6/target/mcu/efm32lg840f128/efm32lg840.c
            p_gpioPin = NULL;
            break;
    }

    return p_gpioPin;
} /* hal_ctrlPinInit() */

/*==============================================================================
  hal_pinInit()
 =============================================================================*/
void* hal_pinInit(en_targetExtPin_t e_pinType)
{
    s_hal_gpio_pin_t* p_gpioPin = NULL;

    switch (e_pinType){
        case E_TARGET_RADIO_RST:

            p_gpioPin = &s_hal_gpio[e_hal_gpios_rf_rst];
            /* configure pin */
            GPIO_PinModeSet( p_gpioPin->port, p_gpioPin->pin, p_gpioPin->mode, p_gpioPin->val );
            /* set pin */
            GPIO_PinOutSet( p_gpioPin->port, p_gpioPin->pin );
            break;

        case E_TARGET_RADIO_SLPTR:

            p_gpioPin = &s_hal_gpio[e_hal_gpios_rf_slp];
            /* configure pin */
            GPIO_PinModeSet( p_gpioPin->port, p_gpioPin->pin, p_gpioPin->mode, p_gpioPin->val );
            /* set pin */
            GPIO_PinOutSet( p_gpioPin->port, p_gpioPin->pin );
            break;

        default:

            p_gpioPin = NULL;
            break;
    }

    return p_gpioPin;
} /* hal_pinInit() */

/*==============================================================================
  hal_pinSet()
 =============================================================================*/
void hal_pinSet(void * p_pin)
{
    s_hal_gpio_pin_t* p_gpioPin;

    if( p_pin != NULL ) {
        p_gpioPin = ( s_hal_gpio_pin_t* )p_pin;
        p_gpioPin->val = 1;
        GPIO_PinOutSet( p_gpioPin->port, p_gpioPin->pin );
    }
} /* hal_pinSet() */

/*==============================================================================
  hal_pinClr()
 =============================================================================*/
void hal_pinClr(void * p_pin)
{
    s_hal_gpio_pin_t* p_gpioPin;

    if( p_pin != NULL ) {
        p_gpioPin = (s_hal_gpio_pin_t*)p_pin;
        p_gpioPin->val = 0;
        GPIO_PinOutClear( p_gpioPin->port, p_gpioPin->pin );
    }
} /* hal_pinClr() */

/*==============================================================================
  hal_pinGet()
 =============================================================================*/
uint8_t    hal_pinGet(void * p_pin)
{
    s_hal_gpio_pin_t* p_gpioPin;

    if(p_pin == NULL) {
        return 0;
    }
    p_gpioPin = (s_hal_gpio_pin_t*)p_pin;
    if( p_gpioPin->mode != gpioModeInput )
        return p_gpioPin->val;
    else
        return GPIO_PinInGet( p_gpioPin->port, p_gpioPin->pin );
} /* hal_pinGet() */

/*==============================================================================
  hal_spiInit()
 =============================================================================*/
void* hal_spiInit(void)
{
    /* configure SPI */
    SPIDRV_Init_t spiInit = EFM32_USART;
    spiInit.portLocation = EFM32_USART_LOC;
    spiInit.csControl = spidrvCsControlApplication;

    /* configure SPI clock frequency of 4MHz */
    spiInit.bitRate = 4000000;

    /* initialize SPI */
    s_hal_spi.pHndl = &s_hal_spi.hndl;
    SPIDRV_Init( s_hal_spi.pHndl, &spiInit );

    /* configure manual chip select pin */
    GPIO_PinModeSet( s_hal_spi.csPin.port, s_hal_spi.csPin.pin,
            s_hal_spi.csPin.mode, s_hal_spi.csPin.val );
    /* set chip select pin */
    GPIO_PinOutSet( s_hal_spi.csPin.port, s_hal_spi.csPin.pin );

    return &s_hal_spi;
} /* hal_spiInit() */

/*==============================================================================
  hal_spiSlaveSel()
 =============================================================================*/
uint8_t hal_spiSlaveSel(void * p_spi, bool action)
{
    s_hal_spiDrv* p_spiHal;

    if (p_spi == NULL) {
        LOG_ERR("SPI was not initialized!");
        return 0;
    }

    p_spiHal = (s_hal_spiDrv*)p_spi;

    if (action) {
        //! [select_slave]
        /* clear chip select pin */
        hal_enterCritical();
        GPIO_PinOutClear( p_spiHal->csPin.port, p_spiHal->csPin.pin );
        //! [select_slave]
    }
    else {
        /* set chip select pin */
        GPIO_PinOutSet( p_spiHal->csPin.port, p_spiHal->csPin.pin );
        hal_exitCritical();
    }
    return 1;
} /* hal_spiSlaveSel() */

/*==============================================================================
  hal_spiRead()
 =============================================================================*/
uint8_t hal_spiRead(uint8_t * p_reg, uint16_t i_length)
{
    //SPIDRV_MReceiveB( s_hal_spi.pHndl, p_reg, i_length );
    for( int i = 0; i < i_length; i++ )
        p_reg[i] = USART_SpiTransfer( s_hal_spi.pHndl->initData.port, 0xff );
    return *p_reg;
} /* hal_spiRead() */

/*==============================================================================
  hal_spiWrite()
 =============================================================================*/
void hal_spiWrite(uint8_t * c_value, uint16_t i_length)
{
    //SPIDRV_MTransmitB( s_hal_spi.pHndl, c_value, i_length );
    for( int i = 0; i < i_length; i++ )
        USART_SpiTransfer( s_hal_spi.pHndl->initData.port, c_value[i] );
} /* hal_spiWrite() */


void hal_spiTxRx(uint8_t *p_tx, uint8_t *p_rx, uint16_t len)
{
    uint16_t ix;

    for (ix = 0; ix < len; ix++) {
        p_rx[ix] = USART_SpiTransfer(s_hal_spi.pHndl->initData.port, p_tx[ix]);
    }

}

/*==============================================================================
  hal_spiTranRead()
 =============================================================================*/
void hal_watchdogReset(void)
{
    WDOG_Feed();
} /* hal_watchdogReset() */

/*==============================================================================
  hal_spiTranRead()
 =============================================================================*/
void hal_watchdogStart(void)
{
    WDOG_Init_TypeDef wdog_init;
    /* start it automatically after the initialization */
    wdog_init.enable = 1;
    /* don't run it during debugging */
    wdog_init.debugRun = 1;
    /* run it at EM2 energy mode */
    wdog_init.em2Run = 1;
    /* run it at EM3 energy mode */
    wdog_init.em3Run = 1;
    /* don't block the MCU from entering to EM4 energy mode (shutdown) */
    wdog_init.em4Block = 0;
    /* don't block software from disabling of LF oscillators */
    wdog_init.swoscBlock = 0;
    /* don't lock the wdog configuration - possible to change the wdog configuration at run time */
    wdog_init.lock = 0;
    /* chose the clock source for the wdog
      if it have to work at EM3 - choose Ultra Low Energy Clock: 1KHz
      for example I choose the Low Energy Clock: 32.768 KHz  */
    wdog_init.clkSel = wdogClkSelLFXO;
    /* choose period for wdog  */
    wdog_init.perSel = wdogPeriod_64k;
    /*
    In this case, I configured the wdog to reset the MCU each 2 seconds :
    Formula -> Time = (1/Clock) * period
    2 sec = (1/32768) * 65537
    */

    /* So, lets init it:  */
    WDOG_Init(&wdog_init);

    /* enable */
    WDOG_Enable( true );
} /* hal_watchdogStart() */

/*==============================================================================
  hal_spiTranRead()
 =============================================================================*/
void hal_watchdogStop(void)
{
    WDOG_Enable( false );
} /* hal_watchdogStop() */

/*==============================================================================
  hal_getTick()
 =============================================================================*/
clock_time_t hal_getTick(void)
{
    return l_hal_tick;
} /* hal_getTick() */

/*==============================================================================
  hal_getSec()
 =============================================================================*/
clock_time_t hal_getSec(void)
{
    return l_hal_sec;
} /* hal_getSec() */


/*==============================================================================
  hal_getTRes()
 =============================================================================*/
clock_time_t hal_getTRes(void)
{
    return CLOCK_SECOND;
} /* hal_getSec() */


/** @} */
/** @} */
/** @} */
